testing_cases/freelyFallingDroplets_SM/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     multiphaseEulerFoam;

startFrom       startTime;

startTime       0.0;

stopAt          endTime;

endTime         0.1;

deltaT          1e-4;

writeControl    runTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.5;

maxDeltaT       1;

functions
{
    //#includeFunc fieldAverage(U.gas, U.liquid, alpha.gas, p)
    /*
    numberDensity
    {
        type                sizeDistribution;
        functionObjectLibs  ("libmultiphaseEulerFoamFunctionObjects.so");

        writeControl        runTime;
        writeInterval       1;

        populationBalance   droplets;
        //regionType          cellZone;
        //name                zone;
        functionType        volume;
        coordinateType      diameter;
    }
    
    outflow
    {
        type            surfaceFieldValue;
        functionObjectLibs ( "libfieldFunctionObjects.so" );
        log             yes;
        writeFields     false;
        regionType      patch;
        name            outlet;
        operation       sum;
        fields          ( alphaRhoPhi.gas alphaRhoPhi.liquid );
    }
    inflow
    {
        type            surfaceFieldValue;
        functionObjectLibs ( "libfieldFunctionObjects.so" );
        log             yes;
        writeFields     false;
        regionType      patch;
        name            inlet;
        operation       sum;
        fields          ( phi.gas phi.liquid alphaPhi.gas alphaPhi.liquid alphaRhoPhi.gas alphaRhoPhi.liquid );
    }
    */
    #includeFunc  residuals
    #includeFunc  probes
    #includeFunc writeObjects(d.liquid)
    #includeFunc fieldMinMax
}


// ************************************************************************* //
