testing_cases/freelyFallingDroplets_SM/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 -0.5 0)
    (4 -0.5 0)
    (4 0.5 0)
    (0 0.5 0)

    (0 -0.5 3)
    (4 -0.5 3)
    (4 0.5 3)
    (0 0.5 3)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 1 150) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (4 5 6 7)
            (1 2 6 5)
            (0 3 2 1)
        );
    }
    
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (7 6 2 3)
        );
    }
);

// ************************************************************************* //
