testing_cases/freelyFallingDroplets_SM/constant/momentumTransport.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  laminar;
/*
simulationType  RAS;

RAS
{
    model    kEpsilon;

    turbulence      on;
    printCoeffs     on;
    /*
    mixtureKEpsilonCoeffs
    {
        Cp  1;
        C3  1;
    }*/
}
*/
// ************************************************************************* //
