testing_cases/freelyFallingDroplets_SM/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//type thermalPhaseChangePopulationBalanceMultiphaseSystem;
//type populationBalanceMultiphaseSystem;
//type basicMultiphaseSystem;
type interfaceCompositionPhaseChangePopulationBalanceMultiphaseSystem;

nInterfaceCorrectors 3;

phases (liquid gas);

populationBalances (droplets);

gas
{
    type            multiComponentPhaseModel;
    
    diameterModel   constant;
    constantCoeffs
    {
        d               1;
    }

    residualAlpha   1e-6;
}

liquid
{
    type            purePhaseModel;
    diameterModel   velocityGroup;
    
    velocityGroupCoeffs
    {
        populationBalance    droplets;

        shapeModel           spherical;

        sizeGroups
        (
            /*
            f1      {dSph    1.0e-06;        value 0;}
            f2      {dSph    5.0e-06;        value 0;}
            f3      {dSph    1.0e-05;        value 0;}
            f4      {dSph    1.5e-05;        value 0;}
            f5      {dSph    2.0e-05;        value 0;}
            f6      {dSph    2.5e-05;        value 0;}
            f7      {dSph    3.0e-05;        value 0;}
            f8      {dSph    3.5e-05;        value 0;}
            f9      {dSph    4.0e-05;        value 0;}
            f10     {dSph    4.5e-05;        value 0;}
            f11     {dSph    5.0e-05;        value 0;}
            f12     {dSph    5.5e-05;        value 0;}
            f13     {dSph    6.0e-05;        value 0;}
            f14     {dSph    6.5e-05;        value 0;}
            f15     {dSph    7.0e-05;        value 0;}
            f16     {dSph    7.5e-05;        value 0;}
            f17     {dSph    8.0e-05;        value 0;}
            f18     {dSph    8.5e-05;        value 0;}
            f19     {dSph    9.0e-05;        value 0;}
            f20     {dSph    9.5e-05;        value 0;}
            f21     {dSph    1.0e-04;        value 1;}
            */
            f1	{dSph	1.0e-07;		value 0;}
            f2	{dSph	5.0e-07;		value 0;}
            f3	{dSph	1.0e-06;		value 0;}
            f4	{dSph	1.5e-06;		value 0;}
            f5	{dSph	2.0e-06;		value 0;}
            f6	{dSph	2.5e-06;		value 0;}
            f7	{dSph	3.0e-06;		value 0;}
            f8	{dSph	3.5e-06;		value 0;}
            f9	{dSph	4.0e-06;		value 0;}
            f10 {dSph	4.5e-06;		value 0;}
            f11 {dSph	5.0e-06;		value 0;}
            f12 {dSph	5.5e-06;		value 0;}
            f13 {dSph	6.0e-06;		value 0;}
            f14 {dSph	6.5e-06;		value 0;}
            f15 {dSph	7.0e-06;		value 0;}
            f16 {dSph	7.5e-06;		value 0;}
            f17 {dSph	8.0e-06;		value 0;}
            f18 {dSph	8.5e-06;		value 0;}
            f19 {dSph	9.0e-06;		value 0;}
            f20 {dSph	9.5e-06;		value 0;}
            f21 {dSph	10.0e-06;		value 1;}
        );
    }
    
    residualAlpha   2e-7;
}

populationBalanceCoeffs
{
    droplets
    {
        continuousPhase gas;

        coalescenceModels
        ();

        binaryBreakupModels
        ();

        breakupModels
        ();

        driftModels
        (
        
            phaseChange
            {
                pairs   ((gas and liquid));
                dmdtf   interfaceCompositionPhaseChange:dmdtf;
            }
        
        );

        nucleationModels
        ();
    }
}

blending
{
    default
    {            
        type                none;
        continuousPhase     gas;
    }
}

drag
(
    
    (liquid in gas)
    {
        type            SchillerNaumann;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }
);

virtualMass
();

surfaceTension
(
    (gas and liquid)
    {
        type           constant;
	sigma          0.0;
    } 
);

aspectRatio
();

heatTransfer.gas
(
    (liquid in gas)
    {
        type RanzMarshall;
        residualAlpha 1e-4;
    }
);

heatTransfer.liquid
(
    (liquid in gas)
    {
        type spherical;
        residualAlpha 1e-4;
    }
);

diffusiveMassTransfer.gas
(
    (liquid in gas)
    {
        type Frossling;
        Le 2.0;
    }
);

diffusiveMassTransfer.liquid
(
    (liquid in gas)
    {
        type spherical;
        Le 2.0;
    }
);

interfaceComposition.liquid
();

interfaceComposition.gas
(
    (gas and liquid)
    {
        type saturated;
        species ( H2O );
        Le 2.0;
        saturationPressure
        {
            type Antoine;
            A      23.952;
            B     -4233.7;
            C     -31.737;
        }
    }
);

phaseTransfer
();

lift
();

wallLubrication
();

turbulentDispersion
(
/*
    (liquid in gas)
    {
        type                Burns;
        sigma               0.7;
    }
*/
);

interfaceCompression
();

// Minimum allowable pressure
pMin            10000;


// ************************************************************************* //
