testing_cases/freelyFallingDroplets_SM/system/fieldMinMax
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            fieldMinMax;
libs            ("libfieldFunctionObjects.so");

writeControl    timeStep;

log             yes;
location        yes;
mode            magnitude;
fields
(
/*
    f1.liquid.droplets
    f2.liquid.droplets
    f3.liquid.droplets
    f4.liquid.droplets
    f5.liquid.droplets
    f6.liquid.droplets
    f7.liquid.droplets
    f8.liquid.droplets
    f9.liquid.droplets
    f10.liquid.droplets
    f11.liquid.droplets
    f12.liquid.droplets
    f13.liquid.droplets
    f14.liquid.droplets
    f15.liquid.droplets
    f16.liquid.droplets
    f17.liquid.droplets
    f18.liquid.droplets
    f19.liquid.droplets
    f20.liquid.droplets
    f21.liquid.droplets
    */
    d.liquid
);

// ************************************************************************* //
