testing_cases/freelyFallingDroplets_SM/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (U.gas U.liquid k.gas alpha.gas alpha.liquid);
probeLocations
(
    (0.01 0 2)
    (0.06 0 2)
    (0.50 0 2)
    (1.00 0 2)
);

// ************************************************************************* //
