testing_cases/freelyFallingDroplets_SM/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          sample;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cellPointFace;

setFormat csv;

sets
(
    x-0.01
    {
        type            lineFace;
        axis            xyz;
        start   (0.01 0 0);
        end     (0.01 0 3);
    }
    x-0.06
    {
        type            lineFace;
        axis            xyz;
        start   (0.06 0 0);
        end     (0.06 0 3);
    }
    x-0.10
    {
        type            lineFace;
        axis            xyz;
        start   (0.1 0 0);
        end     (0.1 0 3);
    }
    x-0.50
    {
        type            lineFace;
        axis            xyz;
        start   (0.5 0 0);
        end     (0.5 0 3);
    }
    x-1.00
    {
        type            lineFace;
        axis            xyz;
        start   (1.0 0 0);
        end     (1.0 0 3);
    }
    x-2.00
    {
        type            lineFace;
        axis            xyz;
        start   (2.0 0 0);
        end     (2.0 0 3);
    }
);

fields
(
    U.gas
    T.gas
    k.gas
    epsilon.gas
    alpha.gas
    U.liquid
    T.liquid
    alpha.liquid
);


// ************************************************************************* //
